tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "remind101/formulae"
tap "stripe/stripe-cli"
brew "anyenv"
brew "aws-sam-cli"
brew "bat"
brew "cfn-lint", link: false
brew "circleci"
brew "colima"
brew "docker", link: false
brew "docker-compose", link: false
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "jq"
brew "neovim"
brew "terraform"
brew "tmux"
brew "tree"
brew "yarn", link: false
brew "zsh-syntax-highlighting"
brew "remind101/formulae/assume-role"
brew "stripe/stripe-cli/stripe"
cask "raycast"
cask "1password"
cask "rectangle"
cask "alacritty"
cask "arc"
cask "github"
cask "android-studio"
cask "clipy"

