tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "remind101/formulae"
tap "stripe/stripe-cli"
# All in one for **env
brew "anyenv"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# DynamoDB CLI
brew "dynein"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# JavaScript package manager
brew "yarn", link: false
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Easily assume AWS roles in your terminal
brew "remind101/formulae/assume-role"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# GPU-accelerated terminal emulator
cask "alacritty"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# Clipboard extension app
cask "clipy"
# Desktop client for GitHub repositories
cask "github"
# Remote desktop client
cask "microsoft-remote-desktop"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
